---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyLockedWarn
source: html/c14f6d26-bbab-9a5c-54da-901e714c10d6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyLockedWarn Property

Can't copy pinned element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyLockedWarn { get; }
```